/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   table_label.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ozharko <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/04/24 09:18:35 by ozharko           #+#    #+#             */
/*   Updated: 2018/04/24 09:18:37 by ozharko          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../main.h"

/*
** i - номер строки; c - номер ячейки;
*/


int		ft_set_value(int i, int c)
{
	int val;

	val = 0;
	if (!c)
		val = 0;
	else if (c == 1)
		val = (!i || i == 8 || i == 11 || i == 14) ? 0 : 1;
	else if (c == 2)
	{
		(i == 0 || i == 3 || i == 4 || i == 12) ? (val = 10) : 0;
		(i == 1 || i ==2) ? (val = 5) : 0;
		(i >= 5 && i <= 7) ? (val = 6) : 0;
		(i == 8) ? (val = 20) : 0;
		(i == 9 || i == 10) ? (val = 25) : 0;
		(i == 11) ? (val = 800) : 0;
		(i == 13) ? (val = 50) : 0;
		(i == 14) ? (val = 1000) : 0;
		(i == 15) ? (val = 2) : 0;
	}
	else if (c == 3)
		val = (c == 3 && ((i >= 0 && i < 8) || i == 12 || i == 15)) ? 4 : 2;
	return (val);
}

/*
** Создать лейбл и передать его ячейки для запи данных по таблице;
*/

void	ft_table_label(t_main *main)
{
	int 	i;
	int		c;

	i = 0;
	while (i < 16)
	{
		c = 0;
		while (c < 4)
		{
			main->label[i][c] = ft_set_value(i, c);
			c++;
		}
		i++;
	}
	// ft_walk_on_array(main);
}
